---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.ArgumentsInconsistentException
source: html/a4a17b83-a1c8-2796-344b-2e5345e6a40b.htm
---
# ArgumentsInconsistentException Members

Retrieves data needed to serialize the target object.